# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EdgeArrayArray..::..Append Method
EdgeArrayArray Class See Also
---
Add the edge array to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	EdgeArray item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As EdgeArray _
)
```

Visual C++
---
```text
public:
virtual void Append(
	EdgeArray^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..EdgeArrayThe edge array to be added.
# See Also
EdgeArrayArray Class
Autodesk.Revit.DB Namespace